; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v6)
             (pred_6 ?v13 ?v4)
             (pred_8 ?v5 ?v4)
             (pred_3 ?v7 ?v5 )
	     (pred_12 ?v5)
             (pred_11 ?v2)
             (pred_10 ?v13)
             (pred_5 ?v4)
             (pred_9 ?v5)
             (pred_2 ?v13)
             (pred_4 ?v5)
             (pred_1 ))



(:action op_1
:parameters (?v12 ?v9 ?v1 ?v3)
:precondition (and (pred_11 ?v12) (pred_11 ?v9) (pred_10 ?v1) (pred_5 ?v3)
          (pred_7 ?v12 ?v9) (pred_6 ?v1 ?v3)
                   (pred_8 ?v9 ?v3) (pred_12 ?v12) 
                   (pred_9 ?v9) (pred_2 ?v1))
:effect (and  (pred_4 ?v9) (not (pred_9 ?v9))))


(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_11 ?v12) (pred_11 ?v10)
               (pred_12 ?v12) (pred_7 ?v12 ?v10) (pred_4 ?v10))
:effect (and (pred_12 ?v10) (not (pred_12 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_11 ?v12) (pred_10 ?v1) 
                  (pred_12 ?v12) (pred_3 ?v1 ?v12) (pred_1 ))
:effect (and (pred_2 ?v1)
   (not (pred_3 ?v1 ?v12)) (not (pred_1 ))))


(:action op_3
:parameters (?v12 ?v8 ?v11)
:precondition (and (pred_11 ?v12) (pred_10 ?v8) (pred_10 ?v11)
                  (pred_12 ?v12) (pred_2 ?v11) (pred_3 ?v8 ?v12))
:effect (and (pred_2 ?v8) (pred_3 ?v11 ?v12)
        (not (pred_2 ?v11)) (not (pred_3 ?v8 ?v12))))

(:action op_4
:parameters (?v12 ?v1)
:precondition (and (pred_11 ?v12) (pred_10 ?v1) 
                  (pred_12 ?v12) (pred_2 ?v1))
:effect (and (pred_1 ) (pred_3 ?v1 ?v12) (not (pred_2 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_16 obj_21 obj_18 obj_03 obj_26 obj_15 obj_22 obj_14 obj_23 obj_20 obj_24 obj_25 obj_12 obj_27 obj_04 obj_10 obj_11 obj_02 obj_31 obj_06 obj_13 obj_17 obj_32 obj_07 obj_09
    obj_30 obj_29 obj_08
    obj_05 obj_19 obj_01 obj_28
    )

    (:init
       (pred_1)

       (pred_11 obj_16)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_03)
       (pred_11 obj_26)
       (pred_11 obj_15)
       (pred_11 obj_22)
       (pred_11 obj_14)
       (pred_11 obj_23)
       (pred_11 obj_20)
       (pred_11 obj_24)
       (pred_11 obj_25)
       (pred_11 obj_12)
       (pred_11 obj_27)
       (pred_11 obj_04)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_31)
       (pred_11 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_17)
       (pred_11 obj_32)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_5 obj_30)
       (pred_5 obj_29)
       (pred_5 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_28)

       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_21 obj_22)
       (pred_7 obj_21 obj_18)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_21)
       (pred_7 obj_03 obj_23)
       (pred_7 obj_03 obj_26)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_26 obj_20)
       (pred_7 obj_26 obj_03)
       (pred_7 obj_15 obj_24)
       (pred_7 obj_15 obj_22)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_22 obj_15)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_23)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_23 obj_27)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_23 obj_03)
       (pred_7 obj_23 obj_14)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_26)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_24 obj_10)
       (pred_7 obj_24 obj_25)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_12)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_24)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_27)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_25)
       (pred_7 obj_27 obj_31)
       (pred_7 obj_27 obj_04)
       (pred_7 obj_27 obj_23)
       (pred_7 obj_27 obj_12)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_27)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_24)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_02 obj_32)
       (pred_7 obj_02 obj_31)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_31 obj_07)
       (pred_7 obj_31 obj_06)
       (pred_7 obj_31 obj_27)
       (pred_7 obj_31 obj_02)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_06 obj_31)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_17 obj_32)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_32 obj_07)
       (pred_7 obj_32 obj_02)
       (pred_7 obj_32 obj_17)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_31)
       (pred_7 obj_07 obj_32)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_09 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_26)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_8  obj_11 obj_30)
       (pred_8  obj_26 obj_29)
       (pred_8  obj_06 obj_08)
       (pred_8  obj_20 obj_30)
       (pred_4 obj_16)
       (pred_4 obj_21)
       (pred_4 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_23)
       (pred_4 obj_24)
       (pred_4 obj_25)
       (pred_4 obj_12)
       (pred_4 obj_27)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_31)
       (pred_4 obj_13)
       (pred_4 obj_17)
       (pred_4 obj_32)
       (pred_4 obj_07)
       (pred_4 obj_09)

       (pred_6  obj_05 obj_30)
       (pred_6  obj_19 obj_29)
       (pred_6  obj_01 obj_08)
       (pred_6  obj_28 obj_30)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_19 obj_22)
       (pred_3 obj_01 obj_31)
       (pred_3 obj_28 obj_13)
       (pred_12 obj_18)
    )

    (:goal (and
       (pred_3 obj_05 obj_07)
       (pred_3 obj_19 obj_26)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_28 obj_27)
    ))
(:constraints
  (always (not (pred_12 obj_14)))
)
)

; plan
1. (op_2 obj_18 obj_03)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_03)
   goals met: 0 of 4
2. (op_2 obj_03 obj_23)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_23)
   goals met: 0 of 4
3. (op_2 obj_23 obj_27)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_27)
   goals met: 0 of 4
4. (op_2 obj_27 obj_31)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_31)
   goals met: 0 of 4
5. (op_5 obj_31 obj_01)
   deleted: (pred_3 obj_01 obj_31) (pred_1)
   added: (pred_2 obj_01)
   goals met: 0 of 4
6. (op_2 obj_31 obj_07)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_07)
   goals met: 0 of 4
7. (op_4 obj_07 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_1) (pred_3 obj_01 obj_07)
   goals met: 0 of 4
8. (op_2 obj_07 obj_32)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_32)
   goals met: 0 of 4
9. (op_2 obj_32 obj_17)
   deleted: (pred_12 obj_32)
   added: (pred_12 obj_17)
   goals met: 0 of 4
10. (op_2 obj_17 obj_13)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_13)
   goals met: 0 of 4
11. (op_5 obj_13 obj_28)
   deleted: (pred_3 obj_28 obj_13) (pred_1)
   added: (pred_2 obj_28)
   goals met: 0 of 4
12. (op_2 obj_13 obj_17)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_17)
   goals met: 0 of 4
13. (op_2 obj_17 obj_32)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_32)
   goals met: 0 of 4
14. (op_2 obj_32 obj_07)
   deleted: (pred_12 obj_32)
   added: (pred_12 obj_07)
   goals met: 0 of 4
15. (op_2 obj_07 obj_31)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_31)
   goals met: 0 of 4
16. (op_2 obj_31 obj_27)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_27)
   goals met: 0 of 4
17. (op_4 obj_27 obj_28)
   deleted: (pred_2 obj_28)
   added: (pred_1) (pred_3 obj_28 obj_27)
   goals met: 1 of 4
18. (op_2 obj_27 obj_31)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_31)
   goals met: 1 of 4
19. (op_2 obj_31 obj_07)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_07)
   goals met: 1 of 4
20. (op_5 obj_07 obj_01)
   deleted: (pred_3 obj_01 obj_07) (pred_1)
   added: (pred_2 obj_01)
   goals met: 1 of 4
21. (op_2 obj_07 obj_31)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_31)
   goals met: 1 of 4
22. (op_2 obj_31 obj_27)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_27)
   goals met: 1 of 4
23. (op_2 obj_27 obj_04)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_04)
   goals met: 1 of 4
24. (op_4 obj_04 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_1) (pred_3 obj_01 obj_04)
   goals met: 2 of 4
25. (op_2 obj_04 obj_27)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_27)
   goals met: 2 of 4
26. (op_2 obj_27 obj_12)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_12)
   goals met: 2 of 4
27. (op_5 obj_12 obj_05)
   deleted: (pred_3 obj_05 obj_12) (pred_1)
   added: (pred_2 obj_05)
   goals met: 2 of 4
28. (op_2 obj_12 obj_27)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_27)
   goals met: 2 of 4
29. (op_2 obj_27 obj_31)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_31)
   goals met: 2 of 4
30. (op_2 obj_31 obj_07)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_07)
   goals met: 2 of 4
31. (op_4 obj_07 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_1) (pred_3 obj_05 obj_07)
   goals met: 3 of 4
32. (op_2 obj_07 obj_31)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_31)
   goals met: 3 of 4
33. (op_2 obj_31 obj_27)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_27)
   goals met: 3 of 4
34. (op_2 obj_27 obj_23)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_23)
   goals met: 3 of 4
35. (op_2 obj_23 obj_03)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_03)
   goals met: 3 of 4
36. (op_2 obj_03 obj_18)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_18)
   goals met: 3 of 4
37. (op_2 obj_18 obj_21)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_21)
   goals met: 3 of 4
38. (op_2 obj_21 obj_22)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_22)
   goals met: 3 of 4
39. (op_5 obj_22 obj_19)
   deleted: (pred_3 obj_19 obj_22) (pred_1)
   added: (pred_2 obj_19)
   goals met: 3 of 4
40. (op_2 obj_22 obj_21)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_21)
   goals met: 3 of 4
41. (op_2 obj_21 obj_18)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_18)
   goals met: 3 of 4
42. (op_2 obj_18 obj_03)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_03)
   goals met: 3 of 4
43. (op_1 obj_03 obj_26 obj_19 obj_29)
   deleted: (pred_9 obj_26)
   added: (pred_4 obj_26)
   goals met: 3 of 4
44. (op_2 obj_03 obj_26)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_26)
   goals met: 3 of 4
45. (op_4 obj_26 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_1) (pred_3 obj_19 obj_26)
   goals met: 4 of 4
